-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2019 年 10 月 12 日 05:18
-- 服务器版本: 5.5.53
-- PHP 版本: 5.4.45

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `study`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE IF NOT EXISTS `admin` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `username` varchar(18) NOT NULL,
  `pwd` varchar(32) NOT NULL,
  `type` int(2) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `admin`
--

INSERT INTO `admin` (`id`, `username`, `pwd`, `type`) VALUES
(1, 'admin', '123', 0);

-- --------------------------------------------------------

--
-- 表的结构 `api_answertemple`
--

CREATE TABLE IF NOT EXISTS `api_answertemple` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(55) NOT NULL,
  `cout` int(5) NOT NULL,
  `belong` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- 转存表中的数据 `api_answertemple`
--

INSERT INTO `api_answertemple` (`id`, `name`, `cout`, `belong`) VALUES
(9, '【智能穿戴测试】- 相对布局', 3, '常亚萍'),
(10, '【智能穿戴测试】- 线性布局', 3, '常亚萍'),
(11, '【智能穿戴测试】- 表格布局', 4, '常亚萍'),
(12, '【智能穿戴测试】- 帧布局', 4, '常亚萍'),
(13, '【智能穿戴测试】- Acitivity的创建', 5, '常亚萍'),
(14, '【智能穿戴测试】- Activity中的数据传递', 5, '常亚萍'),
(15, '【智能穿戴测试】- 文件存储', 5, '常亚萍'),
(16, '【智能穿戴测试】- XML序列化和解析', 5, '常亚萍'),
(17, '【智能穿戴测试】- SQLite数据库', 5, '常亚萍'),
(18, '【智能穿戴测试】- start方式启动服务', 5, '常亚萍'),
(19, '【智能穿戴测试】- bind方式启动服务', 5, '常亚萍'),
(20, '【智能穿戴测试】- SharedPreferences的使用', 5, '常亚萍');

-- --------------------------------------------------------

--
-- 表的结构 `api_code`
--

CREATE TABLE IF NOT EXISTS `api_code` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `phone` varchar(11) NOT NULL,
  `code` varchar(6) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=9 ;

--
-- 转存表中的数据 `api_code`
--

INSERT INTO `api_code` (`id`, `phone`, `code`) VALUES
(1, '13672660891', '7024'),
(4, '15015484386', '3324'),
(5, '18928070670', '4141'),
(6, '', '1449'),
(7, '13058352164', '4633'),
(8, '13232222591', '9695');

-- --------------------------------------------------------

--
-- 表的结构 `api_course`
--

CREATE TABLE IF NOT EXISTS `api_course` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `img` varchar(55) NOT NULL,
  `type` varchar(10) NOT NULL,
  `introduce` varchar(255) NOT NULL,
  `hot` int(10) NOT NULL DEFAULT '0',
  `section` int(4) NOT NULL,
  `test` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=6 ;

--
-- 转存表中的数据 `api_course`
--

INSERT INTO `api_course` (`id`, `name`, `img`, `type`, `introduce`, `hot`, `section`, `test`) VALUES
(1, 'hell', 'newtree.jpg', '文字类', '讲文明，书新风。巴拉巴拉小魔仙。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。', 2, 9, 2),
(3, '测试添加的课程', '15321429663031371.jpg', '文字类', '我测试添加的课程简介呀', 4, 8, 2),
(4, '在线学习视频课程', '15321430349247711.jpg', '视频类', '测试天津的得到 哈哈哈和和和和和阿瑟东as阿瑟东\r\n阿斯顿卡死了', 6, 9, 0),
(5, ' 现代汉字学', '15324010105272857.jpg', '文字类', '本课主要讲述汉字的性质和特点，重点介绍现代汉字的属性，包括字量、字形、字音、字序、汉字规范化（包括政府主管部门颁布的有关汉字的各项标准）等。', 4, 12, 0);

-- --------------------------------------------------------

--
-- 表的结构 `api_coursetextresource`
--

CREATE TABLE IF NOT EXISTS `api_coursetextresource` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `pid` int(10) NOT NULL,
  `section` varchar(10) NOT NULL DEFAULT '',
  `sectiontitle` varchar(55) NOT NULL DEFAULT '',
  `content` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=30 ;

--
-- 转存表中的数据 `api_coursetextresource`
--

INSERT INTO `api_coursetextresource` (`id`, `pid`, `section`, `sectiontitle`, `content`) VALUES
(1, 1, '1', '学习雷锋呀', '一条马路上，红灯停绿灯行，明明红灯，加速的车辆还是速度飞驰\r\n\r\n擦身而过，吓得手里拎着的袋子一松，橘子滚得到处都是\r\n\r\n看着滚得脏兮兮的橘子，突然，很生气，很愤怒\r\n\r\n回去的路上，一路都是满满的负能量，只有一个念头\r\n\r\n怪那辆不懂规则的车辆，这人真不懂礼貌，啊\r\n\r\n越想越生气，不然，现在应该是在家安逸地吃着橘子看着喜欢的节目\r\n\r\n可是，现在连看节目的心情都没有\r\n\r\n这是个很小的案列，也往往出现在日常生活中\r\n\r\n其实，本来突发事情很多，谁都无法知道下一秒会遇到什么人发生什么事\r\n\r\n但不变应万变，那就是我们自己的情绪控制\r\n\r\n正如上述事件，橘子滚落，是已发生不可更改的事情\r\n\r\n而主人翁却花费大量时间纠结在别人的过错，影响自己的心情\r\n\r\n花费时间在不开心的事情上，而且还不是很重要的事情\r\n\r\n转化方式，橘子滚落了，那就从新去买，或者吃点别的\r\n\r\n一切按照自己既定的计划走，那么就不会到晚上还一直耿耿于怀\r\n\r\n综上所述，用别人的过错惩罚自己，有点傻\r\n\r\n尤其是潜意识，或者下意识做得行为\r\n\r\n！！！！！'),
(2, 1, '2', '车水马龙', '广东省阳江市东平镇大澳渔村毗邻渔港，是一座古色古香的渔村，至今仍保持着古渔村的风貌，也是广东省唯一保持着原始渔家小屋风貌的渔村。\r\n\r\n　　7月19日，为探寻改革开放以来粤西乡村社会的发展变迁，岭南师范学院“历史寻踪”社会实践队来到阳江市东平镇大澳渔村开展调研活动，走访了大澳渔村古居民区并参观了大澳渔村文化博物馆。本次实践以实地考察调研和拍摄开展实践活动，以此来深入了解和学习大澳渔村的独特文化及历史发展过程，同时做文化的保护者和传承人。\r\n\r\n　　在文化博物馆里，调研团队怀着崇敬的心情参观了古文物的照片，看到了仿制的风帆船模型和一副鳁鲸骨架等，这是古渔村文化中的重要组成部分。通过实地走访，在采访当地渔委会主任、记事员等过程中，实践队员们更是了解到改革开放以来大澳渔村的发展历程。当地对保存完好的旅游资源进行了重新开发，并建设了“古渔民民居群”景点等，东平大澳渔村很快成为了阳江市的旅游名片之一。\r\n\r\n　　通过本次"三下乡"实践活动的开展，调研团队对大澳渔村风景及其文化进行了学习和拍摄。团队对这几天所见所闻受到了强烈的心灵震撼和洗礼，也意识到让更多人知道大澳渔村风景，学习古渔文化，传承传统渔村文化的重要性。活动结束后，团队成员也纷纷投入到后期整理工作中，都为古渔村文化的宣传努力，争做文化的宣传人和守护人。 '),
(3, 1, '3', '《瓶邪》语录摘抄', '　1、麒麟一笑，阎王绕道。\r\n天真一笑，麒麟开道。\r\n麒麟拔刀，天下折夭。\r\n闷王一闹，吴邪上吊。\r\n\r\n　　2、以前的我崇拜神话，现在的我一眼就能从神话中看出破绽来。\r\n\r\n　　3、我只是起了一个歹毒的念头：假如还有再见的机会，一定要喂他吃几只西班牙大苍蝇，不知道他的体质是否也能免疫。?——一起作死呢这是\r\n\r\n　　4、有时候，事情的真相往往藏在地狱，而那些执着的人，为了真相不惜走进地狱，却不知自己即将失去最宝贵的东西。只可惜，他吴邪选的路，就算虐死、伤透了心，也要把它走完。\r\n\r\n　　5、无数无法触摸的记忆碎片，混着那和世间无关的眼神，混合出了世界上最纯粹的绝望的滋味。\r\n\r\n　　6、此去经年，再也没有一个人会永远陪在他身边了。张起灵看着矮矮的墓碑，没说任何话，眼泪却是一滴一滴的坠落。\r\n……\r\n“张起灵，你愿意用你的长生交换他的命吗？”\r\n“愿意。”为了他，什么都愿意。\r\n……\r\n“这位小哥，让一下！”张起灵抬头，是一位清朗的少年，更重要的是，他是……\r\n“吴邪。”\r\n“啊，小哥你认识我，不好意思，这几年我忘了许多事……”少年搔搔脑袋，不好意思地笑了。\r\n“张起灵。”看着眼前人还没反应过来的样子，又补道“我的名字，记住了，可不许忘。”\r\n他不记得没关系，只要他还在，他们还会像从前一样。\r\n\r\n　　7、人总要有点信仰，外八行的人是拜关公的。盗墓的人，北派拜的是钟馗，南派一般不来这一套，但是长沙那一带有说法，说是拜过一段时间的“黄王”。 ----南派三叔\r\n\r\n　　8、哑巴张，当年追你至长白山青铜门的，是天真，却不是吴邪，不是吴家的小三爷。\r\n\r\n　　9、少年，遥记你初时纯真美好，天真无邪------沙海只是一个转折点，瓶邪--一生一世，永生永世常相伴。\r\n\r\n　　10、哪个像我？哪个像我？我靠，都长得那么衰，每个都他妈像啊。\r\n\r\n　　11、看着不像是生出来的，而是拉出来的\r\n\r\n　　12、十年之后，如果你还记得我\r\n\r\n　　13、我在想，如果当时我立马赶到三叔面前'),
(4, 1, '4', '他说，要紧凑地活着', '别来无往事，光阴不尽凉。\r\n\r\n天气一天天热起来，又伴着反复的大小降温，叫人弄不清到底要穿些什么。早上穿的的外套卫衣中午恨不得脱个精光，要是看到天气预报说今天天气不错温度也不低，以此决定穿件中袖出去，早上准被冻成狗。\r\n\r\n要不是天天住在这里，换谁也不相信地处南方的临安最低气温还能到个位数——放在北方老家，也早就没这温度了。\r\n\r\n乖乖，这可到四月底了呀！\r\n\r\n日子不紧不慢的过着，我们倒是走的越来越快。\r\n\r\n夜时偶有入梦，荒唐离奇，又总伴着白天凡事经历种种。\r\n\r\n作业渐多，有条不紊地赶着，有时赶到凌晨，不过还好有趣，这个作品的分析那个作品的解读，夹杂着一篇小小的剧本。\r\n\r\n室友躺在床上，我在桌旁用着机械键盘在电脑上噼里啪啦地一顿乱敲，享受着在空白的页面上蹦出一个又一个字符的快感。\r\n\r\n空闲时间穿插于满课的空隙，和早上的赖床贪睡。\r\n\r\n楼下的洗衣机往往有人用着，脏衣服攒了一盆，千挑万选找时间下去洗衣。洗衣液快用完，用室友的用了两次，总是忘记买。洗澡用的热水卡余额也见了底，又忘了两天去充值，不知不觉到了周末，人家不开门营业充值。\r\n\r\n有时阳光正好会把被子晒出来，晚上忘了收外面温度降到了个位数，拿回来的被子变得更潮更凉，摊摊手哭笑不得。\r\n\r\n谁都忙，奇怪的是谁都不觉得忙。\r\n\r\n晚上总是九、十点钟回来，赶忙洗澡吹头整理衣服——十一点就熄灯。\r\n\r\n回来的时候已是不早，室友却常常依旧未归，有的在排练，有的在参加创新大赛。\r\n\r\n每个人都有每个人的追求，而为了追求天天嘴上骂骂咧咧的，其实还真不算什么的。嘴上说的再难听，被人骂的再惨，该干的也毫不犹豫的可劲干。\r\n\r\n赶上学期单周周四，下午便无课，但往往有事，有事一忙就忙一下午，没事就睡个午觉。学校的床有种怪异的魔力，一睡午觉就做噩梦，还是那种叫人啼笑皆非的噩梦，尽是些光怪陆离的飞天钻地分身打架的事。出奇的明是噩梦却无法自拔，做的津津有味不愿醒过来。\r\n\r\n醒来却又经常到了傍晚，头痛得睁不开眼，想来也是，这么个性的噩梦，脑袋运转不够快根本做不出来。\r\n\r\n工作，学习，生活，赶路，吃饭，睡觉，运动，梦想，还有光。\r\n\r\n谁不是朝前活着，所以一步都不能停，每一步都走的稳稳当当。一步接一步，走的紧凑，什么时候该做什么事，什么空闲能用来干点更有意义的事情，把时间填的圆满，把岁月交给呼吸。\r\n\r\n往往累的喘不过气来，才会发现之后的每一次呼吸都如释重负。\r\n\r\n我们承担着莫须有的重担，大抵是认定了早晚有天这重担会落在自己身上。\r\n\r\n其实睡觉是一件事情，工作，生活，赶路，追逐光这些都是事情，只是看怎么去定义它们，紧凑地一项随着一项，严格的执行，可能是对自己最好的尊重，而很多人却又对你在乎和认真对待的事情不屑一顾，比如你想要的，和你所追逐的，又或者，睡觉和熬夜。\r\n\r\n活的自在，或许是因为认同自己的存在，而不够自在，又是太在乎身边的人了吧。\r\n\r\n佛说，“趣求诸欲人,常起于希望。诸欲若不遂,恼坏如箭中。”（世亲止欲偈）\r\n\r\n不妨前脚跟后脚，该干的和不该干的，大概心里都清楚。\r\n\r\n写这个题目时，缘是想起那个午后做的一个梦。昔梦早已归入混沌，只记得那个男人，行走在云雾之间，浑身上下什么都看不清晰，他站在我的对面，缓缓地说了一句话。\r\n\r\n他说，“要紧凑的活。”\r\n\r\n随后，好像又是一场令人头痛欲裂的生死逃亡的噩梦。\r\n\r\nB：伏仪《记昨日书》\r\n\r\n瓦南'),
(5, 1, '5', '从来至美之物，皆利于孤行', '至美之物，皆在孤行。\r\n　　美到极致的东西，都是孤独的。\r\n　　它与别人无关，只缘自内心的触角多出更多的捕捉。\r\n　　情感如此，对情感保持尊重的人亦如此。\r\n　　再一次验证了柏拉图的失败。\r\n　　单纯的事物，在俗世面前不堪一击。\r\n　　我们不需要睁开眼睛就会知道，丑陋时时存在，丑陋会永远击穿我们对美好的向往。\r\n　　我们无力扭转理想的坠落，却又无法做到“瞎子”蔡生生那样的假装。\r\n　　这个世界，博情也罢，薄情也罢，谁会在乎？\r\n　　“世界毫发未损，没有停顿。”\r\n　　崇尚艺术、怀有理想主义的人，他们不是最糟的，他们“被困于激情，抑或死于激情，也许都不是最糟的”，\r\n　　至少，他们暴露了无法自知和自愈的缺陷，\r\n　　并由此证实了那朵悬崖上的花，不能碰，不可摘，至美之物，自生自灭。\r\n\r\n　　给那些文艺范儿们做足了煽情的功课。\r\n\r\n　　小资而才气纵横的笔调，很值得小文艺们看一看。\r\n\r\n　　让粗俗和鄙陋都见鬼去吧。\r\n\r\n　　好吧，我煽情了、、、、\r\n\r\n　　曾经，听到残酷的真相，义愤填膺地想去揭露所谓万恶的黑幕，现在的我环臂耸肩静观潜规则这搅屎棍是如何挥斥方遒，成就畜生道的。人老了，不再是当年那七尺昂扬的快意少年郎。只有在他妈的物价飞涨人心不古时，我怒了，愤懑的眼神依旧和腰间的刀同样锋利！可有屁用啊？'),
(6, 1, '6', '至美植物', ''),
(7, 1, '7', '一切都是孤独的', ''),
(8, 1, '8', '别来万事', ''),
(9, 1, '9', '与子内心', ''),
(10, 3, '1', 'emmmmmmmmmmm', 'null'),
(11, 3, '2', '', 'null'),
(12, 3, '3', '', 'null'),
(13, 3, '4', '', 'null'),
(14, 3, '5', '', 'null'),
(15, 3, '6', '', 'null'),
(16, 3, '7', '', 'null'),
(17, 3, '8', '', 'null'),
(18, 5, '1', '', 'null'),
(19, 5, '2', '', 'null'),
(20, 5, '3', '', 'null'),
(21, 5, '4', '', 'null'),
(22, 5, '5', '', 'null'),
(23, 5, '6', '', 'null'),
(24, 5, '7', '', 'null'),
(25, 5, '8', '', 'null'),
(26, 5, '9', '', 'null'),
(27, 5, '10', '', 'null'),
(28, 5, '11', '', 'null'),
(29, 5, '12', '', 'null');

-- --------------------------------------------------------

--
-- 表的结构 `api_courseviedoresource`
--

CREATE TABLE IF NOT EXISTS `api_courseviedoresource` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `section` varchar(10) NOT NULL DEFAULT '',
  `sectiontitle` varchar(55) NOT NULL DEFAULT '',
  `path` varchar(88) NOT NULL DEFAULT '',
  `pid` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `api_courseviedoresource`
--

INSERT INTO `api_courseviedoresource` (`id`, `section`, `sectiontitle`, `path`, `pid`) VALUES
(1, '1', '简单介绍', '15321680893589751.mp4', 4),
(2, '2', '深入学习', '15321681357546203.mp4', 4),
(3, '3', '如何把握时间', '15321681555520598.mp4', 4),
(4, '4', '怎么才能充分发挥自己实力', '', 4),
(5, '5', '认知自我', '', 4),
(6, '6', '找到适合自己的方法', '', 4),
(7, '7', '改正过往', '', 4),
(8, '8', '掌握阅读方式', '', 4),
(9, '9', '课程总结', '', 4);

-- --------------------------------------------------------

--
-- 表的结构 `api_course_delegat`
--

CREATE TABLE IF NOT EXISTS `api_course_delegat` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `coursename` varchar(30) NOT NULL,
  `learning` int(10) NOT NULL,
  `belong` varchar(11) NOT NULL,
  `type` varchar(15) NOT NULL,
  `seciton` int(10) NOT NULL,
  `imgpath` varchar(55) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `api_course_delegat`
--

INSERT INTO `api_course_delegat` (`id`, `coursename`, `learning`, `belong`, `type`, `seciton`, `imgpath`) VALUES
(1, 'Java程序设计', 185, '常亚萍', '计算机', 20, '/courseresource/master_java.png'),
(2, 'PHP程序设计', 98, '于正老师', '计算机', 20, '/courseresource/master_php.jpg'),
(5, '智能穿戴设备开发基础', 140, '常亚萍', '计算机', 8, '/courseresource/android.jpg'),
(6, 'Python3入门+进阶', 45, '管理员', '计算机', 4, '/courseimg/15508823909402343.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `api_disscuz`
--

CREATE TABLE IF NOT EXISTS `api_disscuz` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `pid` int(10) NOT NULL,
  `user` varchar(11) NOT NULL,
  `say` varchar(255) NOT NULL,
  `time` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=23 ;

-- --------------------------------------------------------

--
-- 表的结构 `api_interlocution`
--

CREATE TABLE IF NOT EXISTS `api_interlocution` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `cid` int(10) NOT NULL,
  `title` varchar(55) NOT NULL,
  `content` text NOT NULL,
  `user` varchar(11) NOT NULL,
  `time` varchar(35) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=16 ;

--
-- 转存表中的数据 `api_interlocution`
--

INSERT INTO `api_interlocution` (`id`, `cid`, `title`, `content`, `user`, `time`) VALUES
(1, 5, '如何理解Activity生命周期的各个方法', '如题描述', '13672660891', '2018-09-29 19:59:18'),
(2, 5, '我有点不明白老师第一章中讲的android体系结构', '应用程序如何调用底层的类库', '18219265976', '2018-09-29 20:11:12'),
(3, 5, '如何让我的程序停止执行下去了?', '我想实现一个功能如在这个页面停留一段时间后再开始跳转', '13058352164', '2018-10-05 16:43:44'),
(4, 5, '第二章的2.3表格布局用得多吗?', '我发现用表格布局可以实现linearLAyout+RelationLayout结合的效果', '13058352164', '2018-10-05 17:18:32'),
(5, 5, 'android中如何防止内存泄漏?', '比如我每次调用一个类都new,而如果进行来代码里我没有再用到它了是否会产生有内存泄漏的风险。', '13672660891', '2018-10-06 09:15:11'),
(6, 5, '如何设置布局的方向', '比如LinearLayout是设置属性?', '13058352164', '2018-10-06 12:22:32'),
(8, 5, '如何设置应用横竖屏的？', '我想实现一个如随手机方向改变屏幕方向的功能', '13672660891', '2018-10-06 17:29:55'),
(9, 5, '老师，实际开发中，那种布局用得最多？', '相对布局还是线性布局呢', '18219265796', '2018-10-07 14:09:11'),
(10, 5, '两个Activity之间传递数据用什么？', 'Intent还是通过数据存储再取出来的', '13672660891', '2018-10-07 14:12:43'),
(15, 2, '我想问问PHP的环境是再Windows下安装好还是Linux下', '如题所述', '17827930822', '2018-10-30 11:11:12');

-- --------------------------------------------------------

--
-- 表的结构 `api_interlocution_reply`
--

CREATE TABLE IF NOT EXISTS `api_interlocution_reply` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `content` varchar(255) NOT NULL,
  `like` int(10) NOT NULL,
  `time` varchar(30) NOT NULL,
  `user` varchar(11) NOT NULL,
  `pid` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- 转存表中的数据 `api_interlocution_reply`
--

INSERT INTO `api_interlocution_reply` (`id`, `content`, `like`, `time`, `user`, `pid`) VALUES
(1, '我觉得你应该考虑一下去看看书籍，然后从书中就可以找对详细的流程了', 5, '2018-10-29 20:09:11', '18219265976', 1),
(2, '我觉得这个问题应该这样解决xxxxxx', 10, '2018-10-29 21:12:55', '13058352164', 1),
(6, 'tests', 0, '2019-02-13 09:30', '13672660891', 0),
(7, 'rrrrr', 0, '2019-02-13 09:31', '13672660891', 0),
(8, 'sssss', 0, '2019-02-13 09:32', '13672660891', 0),
(9, 'ßssssss', 0, '2019-02-13 11:28', '13672660891', 0),
(10, 'Ziff FFC', 0, '2019-02-13 11:38', '13672660891', 0),
(11, 'we www', 0, '2019-02-13 11:41', '13672660891', 0),
(12, 'refer refer', 0, '2019-02-13 11:46', '13672660891', 0),
(13, 'freer', 0, '2019-02-13 11:49', '13672660891', 0),
(14, 'Ford FCC', 0, '2019-02-13 11:55', '13672660891', 1),
(15, 'FCC', 0, '2019-02-13 11:55', '13672660891', 1),
(16, 'I am come in', 0, '2019-02-13 12:19', '13672660891', 2),
(17, '等于1', 0, '2019-02-14 08:50', '13672660891', 3),
(18, '测试回复', 0, '1570625398', 'admin', 1),
(19, '测试回复1', 0, '2019:10:09 12:10:50', 'admin', 1),
(20, '回复1111', 0, '2019:10:09 12:10:50', 'admin', 1);

-- --------------------------------------------------------

--
-- 表的结构 `api_leaning_infos`
--

CREATE TABLE IF NOT EXISTS `api_leaning_infos` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `sid` int(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `classname` varchar(20) NOT NULL,
  `times` varchar(50) NOT NULL,
  `user` varchar(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `api_leaning_infos`
--

INSERT INTO `api_leaning_infos` (`id`, `sid`, `name`, `classname`, `times`, `user`) VALUES
(1, 7, '周庚明', '17移动应用开发1班', '2018-10-14 08:25:02', '13672660891'),
(4, 7, '周小明', '17移动应用开发1班', '2018-10-15 11:41:24', '13058352164');

-- --------------------------------------------------------

--
-- 表的结构 `api_learning_recorder`
--

CREATE TABLE IF NOT EXISTS `api_learning_recorder` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `belong_section` int(10) NOT NULL DEFAULT '0',
  `user` varchar(11) NOT NULL,
  `isread` int(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- 转存表中的数据 `api_learning_recorder`
--

INSERT INTO `api_learning_recorder` (`id`, `belong_section`, `user`, `isread`) VALUES
(1, 1, '13672660891', 1),
(2, 2, '13672660891', 0);

-- --------------------------------------------------------

--
-- 表的结构 `api_message`
--

CREATE TABLE IF NOT EXISTS `api_message` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `target` int(10) NOT NULL,
  `teacher` varchar(30) NOT NULL,
  `coursename` varchar(50) NOT NULL,
  `message` varchar(55) NOT NULL,
  `isread` int(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=346 ;

--
-- 转存表中的数据 `api_message`
--

INSERT INTO `api_message` (`id`, `target`, `teacher`, `coursename`, `message`, `isread`) VALUES
(1, 1, '常亚萍', '2.1小节内容更新了哟', '同学们快来围观啊啊啊啊', 1),
(2, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(3, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(4, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(5, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(6, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(7, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(8, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(9, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(10, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(11, 2147483647, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(12, 1, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 1),
(13, 2, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 1),
(14, 3, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 1),
(15, 5, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 1),
(16, 13, '常亚萍', '1.1Android简介..', '同学们快来听课哟！', 0),
(17, 1, '常亚萍', '1.2Android开发环境搭建', '同学们快来听课哟！', 1),
(18, 2, '常亚萍', '1.2Android开发环境搭建', '同学们快来听课哟！', 1),
(19, 3, '常亚萍', '1.2Android开发环境搭建', '同学们快来听课哟！', 0),
(20, 5, '常亚萍', '1.2Android开发环境搭建', '同学们快来听课哟！', 1),
(21, 13, '常亚萍', '1.2Android开发环境搭建', '同学们快来听课哟！', 0),
(22, 1, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(23, 3, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(24, 6, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(25, 13, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(26, 1, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(27, 3, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(28, 6, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(29, 13, '常亚萍', '3.1 Activity的创建', '同学们快来听课哟！', 0),
(30, 1, '常亚萍', '2.1 相对布局', '同学们快来听课哟！', 0),
(31, 3, '常亚萍', '2.1 相对布局', '同学们快来听课哟！', 0),
(32, 6, '常亚萍', '2.1 相对布局', '同学们快来听课哟！', 0),
(33, 13, '常亚萍', '2.1 相对布局', '同学们快来听课哟！', 0),
(34, 1, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(35, 2, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(36, 3, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(37, 4, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(38, 5, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(39, 6, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(40, 13, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(41, 14, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(42, 15, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(43, 16, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(44, 17, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(45, 18, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(46, 19, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(47, 1, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(48, 2, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(49, 3, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(50, 4, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(51, 5, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(52, 6, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(53, 13, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(54, 14, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(55, 15, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(56, 16, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(57, 17, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(58, 18, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(59, 19, '常亚萍', 'Android开发环境搭建', '同学们快来听课哟！', 0),
(60, 1, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(61, 2, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(62, 3, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(63, 4, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(64, 5, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(65, 6, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(66, 13, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(67, 14, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(68, 15, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(69, 16, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(70, 17, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(71, 18, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(72, 19, '常亚萍', '开发第一个Android程序', '同学们快来听课哟！', 0),
(73, 1, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(74, 2, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(75, 3, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(76, 4, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(77, 5, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(78, 6, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(79, 13, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(80, 14, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(81, 15, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(82, 16, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(83, 17, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(84, 18, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(85, 19, '常亚萍', '相对布局', '同学们快来听课哟！', 0),
(86, 1, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(87, 2, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(88, 3, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(89, 4, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(90, 5, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(91, 6, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(92, 13, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(93, 14, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(94, 15, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(95, 16, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(96, 17, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(97, 18, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(98, 19, '常亚萍', '线性布局', '同学们快来听课哟！', 0),
(99, 1, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(100, 2, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(101, 3, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(102, 4, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(103, 5, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(104, 6, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(105, 13, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(106, 14, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(107, 15, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(108, 16, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(109, 17, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(110, 18, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(111, 19, '常亚萍', '表格布局', '同学们快来听课哟！', 0),
(112, 1, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(113, 2, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(114, 3, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(115, 4, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(116, 5, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(117, 6, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(118, 13, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(119, 14, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(120, 15, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(121, 16, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(122, 17, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(123, 18, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(124, 19, '常亚萍', '网格布局', '同学们快来听课哟！', 0),
(125, 1, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(126, 2, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(127, 3, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(128, 4, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(129, 5, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(130, 6, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(131, 13, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(132, 14, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(133, 15, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(134, 16, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(135, 17, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(136, 18, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(137, 19, '常亚萍', '帧布局', '同学们快来听课哟！', 0),
(138, 1, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(139, 2, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(140, 3, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(141, 4, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(142, 5, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(143, 6, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(144, 13, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(145, 14, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(146, 15, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(147, 16, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(148, 17, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(149, 18, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(150, 19, '常亚萍', '绝对布局', '同学们快来听课哟！', 0),
(151, 1, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(152, 2, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(153, 3, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(154, 4, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(155, 5, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(156, 6, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(157, 13, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(158, 14, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(159, 15, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(160, 16, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(161, 17, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(162, 18, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(163, 19, '常亚萍', 'Activity的创建', '同学们快来听课哟！', 0),
(164, 1, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(165, 2, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(166, 3, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(167, 4, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(168, 5, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(169, 6, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(170, 13, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(171, 14, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(172, 15, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(173, 16, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(174, 17, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(175, 18, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(176, 19, '常亚萍', 'Activity中的数据传递', '同学们快来听课哟！', 0),
(177, 1, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(178, 2, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(179, 3, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(180, 4, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(181, 5, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(182, 6, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(183, 13, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(184, 14, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(185, 15, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(186, 16, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(187, 17, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(188, 18, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(189, 19, '常亚萍', '文件存储', '同学们快来听课哟！', 0),
(190, 1, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(191, 2, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(192, 3, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(193, 4, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(194, 5, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(195, 6, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(196, 13, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(197, 14, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(198, 15, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(199, 16, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(200, 17, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(201, 18, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(202, 19, '常亚萍', 'XML序列化和解析', '同学们快来听课哟！', 0),
(203, 1, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(204, 2, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(205, 3, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(206, 4, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(207, 5, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(208, 6, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(209, 13, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(210, 14, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(211, 15, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(212, 16, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(213, 17, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(214, 18, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(215, 19, '常亚萍', 'SharedPreferences的使用', '同学们快来听课哟！', 0),
(216, 1, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(217, 2, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(218, 3, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(219, 4, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(220, 5, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(221, 6, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(222, 13, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(223, 14, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(224, 15, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(225, 16, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(226, 17, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(227, 18, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(228, 19, '常亚萍', '数据库的常用操作', '同学们快来听课哟！', 0),
(229, 1, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(230, 2, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(231, 3, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(232, 4, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(233, 5, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(234, 6, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(235, 13, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(236, 14, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(237, 15, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(238, 16, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(239, 17, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(240, 18, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(241, 19, '常亚萍', 'ListView控件', '同学们快来听课哟！', 0),
(242, 1, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(243, 2, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(244, 3, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(245, 4, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(246, 5, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(247, 6, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(248, 13, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(249, 14, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(250, 15, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(251, 16, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(252, 17, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(253, 18, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(254, 19, '常亚萍', '读取数据库中的内容显示到ListView中', '同学们快来听课哟！', 0),
(255, 1, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(256, 2, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(257, 3, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(258, 4, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(259, 5, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(260, 6, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(261, 13, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(262, 14, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(263, 15, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(264, 16, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(265, 17, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(266, 18, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(267, 19, '常亚萍', '读取联系人信息', '同学们快来听课哟！', 0),
(268, 1, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(269, 2, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(270, 3, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(271, 4, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(272, 5, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(273, 6, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(274, 13, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(275, 14, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(276, 15, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(277, 16, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(278, 17, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(279, 18, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(280, 19, '常亚萍', '读取短信信息', '同学们快来听课哟！', 0),
(281, 1, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(282, 2, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(283, 3, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(284, 4, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(285, 5, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(286, 6, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(287, 13, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(288, 14, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(289, 15, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(290, 16, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(291, 17, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(292, 18, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(293, 19, '常亚萍', '服务的创建', '同学们快来听课哟！', 0),
(294, 1, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(295, 2, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(296, 3, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(297, 4, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(298, 5, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(299, 6, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(300, 13, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(301, 14, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(302, 15, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(303, 16, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(304, 17, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(305, 18, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(306, 19, '常亚萍', 'start方式启动服务', '同学们快来听课哟！', 0),
(307, 1, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(308, 2, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(309, 3, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(310, 4, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(311, 5, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(312, 6, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(313, 13, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(314, 14, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(315, 15, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(316, 16, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(317, 17, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(318, 18, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(319, 19, '常亚萍', 'bind方式启动服务', '同学们快来听课哟！', 0),
(320, 1, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(321, 2, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(322, 3, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(323, 4, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(324, 5, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(325, 6, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(326, 13, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(327, 14, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(328, 15, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(329, 16, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(330, 17, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(331, 18, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(332, 19, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(333, 1, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(334, 2, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(335, 3, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(336, 4, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(337, 5, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(338, 6, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(339, 13, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(340, 14, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(341, 15, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(342, 16, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(343, 17, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(344, 18, '常亚萍', 'Android简介', '同学们快来听课哟！', 0),
(345, 19, '常亚萍', 'Android简介', '同学们快来听课哟！', 0);

-- --------------------------------------------------------

--
-- 表的结构 `api_score`
--

CREATE TABLE IF NOT EXISTS `api_score` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `coursename` varchar(55) NOT NULL,
  `score` varchar(3) NOT NULL,
  `user` varchar(11) NOT NULL,
  `time` varchar(20) NOT NULL,
  `usertype` varchar(10) NOT NULL,
  `courseid` int(10) NOT NULL,
  `times` varchar(20) NOT NULL,
  `version` varchar(50) DEFAULT NULL,
  `sid` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=730 ;

--
-- 转存表中的数据 `api_score`
--

INSERT INTO `api_score` (`id`, `coursename`, `score`, `user`, `time`, `usertype`, `courseid`, `times`, `version`, `sid`) VALUES
(53, '智能穿戴设备开发基础', '80', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '323', 'XML序列化和解析', 1062),
(710, '智能穿戴设备开发基础', '85', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '321', '帧布局', 1045),
(641, '智能穿戴设备开发基础', '86', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '322', '线性布局', 1042),
(642, '智能穿戴设备开发基础', '85', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '347', '线性布局', 1042),
(60, '智能穿戴设备开发基础', '90', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '336', '表格布局', 1043),
(62, '智能穿戴设备开发基础', '86', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '292', 'SharedPreferences的使用', 1063),
(63, '智能穿戴设备开发基础', '76', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '326', 'SharedPreferences的使用', 1063),
(640, '智能穿戴设备开发基础', '86', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '288', '线性布局', 1042),
(67, '智能穿戴设备开发基础', '97', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '284', '表格布局', 1043),
(69, '智能穿戴设备开发基础', '98', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '285', 'ListView控件', 1072),
(708, '智能穿戴设备开发基础', '88', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '297', '帧布局', 1045),
(709, '智能穿戴设备开发基础', '89', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '330', '帧布局', 1045),
(639, '智能穿戴设备开发基础', '84', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '334', '线性布局', 1042),
(73, '智能穿戴设备开发基础', '81', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '306', '数据库的常用操作', 1071),
(74, '智能穿戴设备开发基础', '95', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '299', 'XML序列化和解析', 1062),
(685, '智能穿戴设备开发基础', '75', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '300', '相对布局', 1041),
(78, '智能穿戴设备开发基础', '86', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '289', 'ListView控件', 1072),
(706, '智能穿戴设备开发基础', '88', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '307', '帧布局', 1045),
(707, '智能穿戴设备开发基础', '91', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '296', '帧布局', 1045),
(704, '智能穿戴设备开发基础', '88', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '312', '帧布局', 1045),
(705, '智能穿戴设备开发基础', '86', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '292', '帧布局', 1045),
(83, '智能穿戴设备开发基础', '99', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '282', 'ListView控件', 1072),
(694, '智能穿戴设备开发基础', '83', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '320', '相对布局', 1041),
(695, '智能穿戴设备开发基础', '84', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '292', '相对布局', 1041),
(696, '智能穿戴设备开发基础', '80', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '343', '相对布局', 1041),
(697, '智能穿戴设备开发基础', '81', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '310', '相对布局', 1041),
(89, '智能穿戴设备开发基础', '67', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '332', '线性布局', 1042),
(560, '智能穿戴设备开发基础', '92', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '296', 'ListView控件', 1072),
(561, '智能穿戴设备开发基础', '94', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '349', 'ListView控件', 1072),
(92, '智能穿戴设备开发基础', '98', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '330', '数据库的常用操作', 1071),
(94, '智能穿戴设备开发基础', '98', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '321', 'XML序列化和解析', 1062),
(96, '智能穿戴设备开发基础', '76', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '297', 'XML序列化和解析', 1062),
(702, '智能穿戴设备开发基础', '85', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '301', '帧布局', 1045),
(703, '智能穿戴设备开发基础', '90', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '320', '帧布局', 1045),
(692, '智能穿戴设备开发基础', '86', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '299', '相对布局', 1041),
(693, '智能穿戴设备开发基础', '87', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '292', '相对布局', 1041),
(102, '智能穿戴设备开发基础', '94', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '341', '数据库的常用操作', 1071),
(107, '智能穿戴设备开发基础', '83', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '289', 'SharedPreferences的使用', 1063),
(108, '智能穿戴设备开发基础', '80', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '341', 'XML序列化和解析', 1062),
(605, '智能穿戴设备开发基础', '81', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '283', '绝对布局', 1046),
(113, '智能穿戴设备开发基础', '64', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '293', 'SharedPreferences的使用', 1063),
(114, '智能穿戴设备开发基础', '68', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '293', '表格布局', 1043),
(726, '智能穿戴设备开发基础', '99', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '308', 'XML序列化和解析', 1062),
(725, '智能穿戴设备开发基础', '69', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '296', '帧布局', 1045),
(724, '智能穿戴设备开发基础', '69', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '304', '帧布局', 1045),
(700, '智能穿戴设备开发基础', '87', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '297', '帧布局', 1045),
(701, '智能穿戴设备开发基础', '88', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '344', '帧布局', 1045),
(119, '智能穿戴设备开发基础', '100', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '281', '线性布局', 1042),
(690, '智能穿戴设备开发基础', '85', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '292', '相对布局', 1041),
(123, '智能穿戴设备开发基础', '100', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '350', '网格布局', 1044),
(124, '智能穿戴设备开发基础', '93', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '316', 'ListView控件', 1072),
(125, '智能穿戴设备开发基础', '93', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '321', '线性布局', 1042),
(638, '智能穿戴设备开发基础', '86', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '288', '网格布局', 1044),
(603, '智能穿戴设备开发基础', '79', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '294', '绝对布局', 1046),
(130, '智能穿戴设备开发基础', '70', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '327', 'XML序列化和解析', 1062),
(559, '智能穿戴设备开发基础', '92', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '342', 'ListView控件', 1072),
(132, '智能穿戴设备开发基础', '80', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '344', '数据库的常用操作', 1071),
(134, '智能穿戴设备开发基础', '88', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '348', '网格布局', 1044),
(137, '智能穿戴设备开发基础', '96', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '325', '数据库的常用操作', 1071),
(556, '智能穿戴设备开发基础', '89', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '340', 'ListView控件', 1072),
(557, '智能穿戴设备开发基础', '93', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '339', 'ListView控件', 1072),
(558, '智能穿戴设备开发基础', '85', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '334', 'ListView控件', 1072),
(141, '智能穿戴设备开发基础', '49', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '340', '数据库的常用操作', 1071),
(555, '智能穿戴设备开发基础', '91', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '318', 'ListView控件', 1072),
(646, '智能穿戴设备开发基础', '86', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '328', '线性布局', 1042),
(647, '智能穿戴设备开发基础', '84', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '291', '线性布局', 1042),
(691, '智能穿戴设备开发基础', '85', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '306', '相对布局', 1041),
(645, '智能穿戴设备开发基础', '86', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '287', '线性布局', 1042),
(554, '智能穿戴设备开发基础', '89', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '306', 'ListView控件', 1072),
(154, '智能穿戴设备开发基础', '57', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '342', 'XML序列化和解析', 1062),
(574, '智能穿戴设备开发基础', '92', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '315', 'SharedPreferences的使用', 1072),
(158, '智能穿戴设备开发基础', '53', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '322', '表格布局', 1043),
(699, '智能穿戴设备开发基础', '84', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '281', '相对布局', 1041),
(573, '智能穿戴设备开发基础', '94', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '342', 'SharedPreferences的使用', 1072),
(572, '智能穿戴设备开发基础', '94', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '313', 'SharedPreferences的使用', 1072),
(165, '智能穿戴设备开发基础', '60', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '301', 'XML序列化和解析', 1062),
(167, '智能穿戴设备开发基础', '55', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '319', '表格布局', 1043),
(698, '智能穿戴设备开发基础', '82', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '290', '相对布局', 1041),
(174, '智能穿戴设备开发基础', '58', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '320', 'XML序列化和解析', 1062),
(176, '智能穿戴设备开发基础', '53', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '325', '数据库的常用操作', 1071),
(178, '智能穿戴设备开发基础', '51', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '312', '表格布局', 1043),
(179, '智能穿戴设备开发基础', '60', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '347', 'SharedPreferences的使用', 1063),
(180, '智能穿戴设备开发基础', '59', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '315', 'XML序列化和解析', 1062),
(181, '智能穿戴设备开发基础', '59', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '283', 'XML序列化和解析', 1062),
(182, '智能穿戴设备开发基础', '52', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '335', '线性布局', 1042),
(183, '智能穿戴设备开发基础', '58', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '294', 'XML序列化和解析', 1062),
(185, '智能穿戴设备开发基础', '56', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '303', '表格布局', 1043),
(570, '智能穿戴设备开发基础', '92', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '295', 'SharedPreferences的使用', 1072),
(189, '智能穿戴设备开发基础', '58', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '297', 'XML序列化和解析', 1062),
(190, '智能穿戴设备开发基础', '50', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '288', 'ListView控件', 1072),
(569, '智能穿戴设备开发基础', '92', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '331', 'SharedPreferences的使用', 1072),
(568, '智能穿戴设备开发基础', '89', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '291', 'SharedPreferences的使用', 1072),
(567, '智能穿戴设备开发基础', '91', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '280', 'SharedPreferences的使用', 1072),
(566, '智能穿戴设备开发基础', '96', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '324', 'SharedPreferences的使用', 1072),
(195, '智能穿戴设备开发基础', '84', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '339', 'SharedPreferences的使用', 1063),
(197, '智能穿戴设备开发基础', '92', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '345', '数据库的常用操作', 1071),
(198, '智能穿戴设备开发基础', '81', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '349', 'SharedPreferences的使用', 1063),
(199, '智能穿戴设备开发基础', '92', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '320', 'ListView控件', 1072),
(565, '智能穿戴设备开发基础', '90', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '341', 'SharedPreferences的使用', 1072),
(689, '智能穿戴设备开发基础', '80', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '322', '相对布局', 1041),
(202, '智能穿戴设备开发基础', '86', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '280', 'XML序列化和解析', 1062),
(203, '智能穿戴设备开发基础', '84', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '287', 'ListView控件', 1072),
(564, '智能穿戴设备开发基础', '89', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '324', 'SharedPreferences的使用', 1072),
(205, '智能穿戴设备开发基础', '82', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '305', 'ListView控件', 1072),
(207, '智能穿戴设备开发基础', '95', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1063),
(211, '智能穿戴设备开发基础', '89', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1063),
(213, '智能穿戴设备开发基础', '88', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '298', 'ListView控件', 1072),
(216, '智能穿戴设备开发基础', '90', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '314', '绝对布局', 1046),
(217, '智能穿戴设备开发基础', '95', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '294', 'ListView控件', 1072),
(222, '智能穿戴设备开发基础', '94', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '294', 'SharedPreferences的使用', 1063),
(223, '智能穿戴设备开发基础', '92', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '310', '绝对布局', 1046),
(225, '智能穿戴设备开发基础', '85', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '317', '数据库的常用操作', 1071),
(226, '智能穿戴设备开发基础', '91', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '344', 'SharedPreferences的使用', 1063),
(228, '智能穿戴设备开发基础', '87', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '310', 'XML序列化和解析', 1062),
(546, '智能穿戴设备开发基础', '99', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '287', 'ListView控件', 1072),
(231, '智能穿戴设备开发基础', '95', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '311', 'SharedPreferences的使用', 1063),
(233, '智能穿戴设备开发基础', '80', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '316', '绝对布局', 1046),
(234, '智能穿戴设备开发基础', '91', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '295', 'SharedPreferences的使用', 1063),
(545, '智能穿戴设备开发基础', '99', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '331', 'ListView控件', 1072),
(237, '智能穿戴设备开发基础', '88', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '308', 'SharedPreferences的使用', 1063),
(544, '智能穿戴设备开发基础', '100', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '313', 'ListView控件', 1072),
(240, '智能穿戴设备开发基础', '83', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '341', 'XML序列化和解析', 1062),
(241, '智能穿戴设备开发基础', '82', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '342', '数据库的常用操作', 1071),
(242, '智能穿戴设备开发基础', '88', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '292', '数据库的常用操作', 1071),
(243, '智能穿戴设备开发基础', '91', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '346', '数据库的常用操作', 1071),
(244, '智能穿戴设备开发基础', '94', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '283', '数据库的常用操作', 1071),
(245, '智能穿戴设备开发基础', '89', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '299', '数据库的常用操作', 1071),
(246, '智能穿戴设备开发基础', '82', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '300', '数据库的常用操作', 1071),
(247, '智能穿戴设备开发基础', '95', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '325', '数据库的常用操作', 1071),
(248, '智能穿戴设备开发基础', '84', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '325', '数据库的常用操作', 1071),
(249, '智能穿戴设备开发基础', '84', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '282', '数据库的常用操作', 1071),
(250, '智能穿戴设备开发基础', '85', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '304', '数据库的常用操作', 1071),
(251, '智能穿戴设备开发基础', '95', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '284', '数据库的常用操作', 1071),
(252, '智能穿戴设备开发基础', '91', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '333', '数据库的常用操作', 1071),
(253, '智能穿戴设备开发基础', '86', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '343', '数据库的常用操作', 1071),
(254, '智能穿戴设备开发基础', '88', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '298', '数据库的常用操作', 1071),
(255, '智能穿戴设备开发基础', '94', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '326', '数据库的常用操作', 1071),
(256, '智能穿戴设备开发基础', '94', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '283', '数据库的常用操作', 1071),
(257, '智能穿戴设备开发基础', '86', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '290', '数据库的常用操作', 1071),
(258, '智能穿戴设备开发基础', '88', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '330', '数据库的常用操作', 1071),
(259, '智能穿戴设备开发基础', '87', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '322', '数据库的常用操作', 1071),
(260, '智能穿戴设备开发基础', '94', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '332', '数据库的常用操作', 1071),
(261, '智能穿戴设备开发基础', '90', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '349', '数据库的常用操作', 1071),
(315, '智能穿戴设备开发基础', '94', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '319', '数据库的常用操作', 1071),
(316, '智能穿戴设备开发基础', '88', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '307', '数据库的常用操作', 1071),
(317, '智能穿戴设备开发基础', '80', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '281', '数据库的常用操作', 1071),
(318, '智能穿戴设备开发基础', '80', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '318', '数据库的常用操作', 1071),
(323, '智能穿戴设备开发基础', '94', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '299', '数据库的常用操作', 1071),
(324, '智能穿戴设备开发基础', '93', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '306', '数据库的常用操作', 1071),
(329, '智能穿戴设备开发基础', '92', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '340', '数据库的常用操作', 1071),
(680, '智能穿戴设备开发基础', '73', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '321', '相对布局', 1041),
(675, '智能穿戴设备开发基础', '76', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '313', '相对布局', 1041),
(676, '智能穿戴设备开发基础', '78', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '349', '相对布局', 1041),
(677, '智能穿戴设备开发基础', '82', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '339', '相对布局', 1041),
(678, '智能穿戴设备开发基础', '84', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '340', '相对布局', 1041),
(679, '智能穿戴设备开发基础', '70', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '303', '相对布局', 1041),
(587, '智能穿戴设备开发基础', '82', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '293', 'SharedPreferences的使用', 1063),
(588, '智能穿戴设备开发基础', '94', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '295', 'SharedPreferences的使用', 1063),
(589, '智能穿戴设备开发基础', '94', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '295', 'SharedPreferences的使用', 1063),
(590, '智能穿戴设备开发基础', '96', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '303', 'SharedPreferences的使用', 1063),
(347, '智能穿戴设备开发基础', '94', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '306', '文件存储', 1061),
(348, '智能穿戴设备开发基础', '91', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '322', '文件存储', 1061),
(349, '智能穿戴设备开发基础', '86', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '298', '文件存储', 1061),
(350, '智能穿戴设备开发基础', '80', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '342', '文件存储', 1061),
(351, '智能穿戴设备开发基础', '94', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '334', '文件存储', 1061),
(352, '智能穿戴设备开发基础', '89', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '346', '文件存储', 1061),
(353, '智能穿戴设备开发基础', '81', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '343', '文件存储', 1061),
(354, '智能穿戴设备开发基础', '95', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '345', '文件存储', 1061),
(355, '智能穿戴设备开发基础', '82', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '304', '文件存储', 1061),
(356, '智能穿戴设备开发基础', '86', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '329', '文件存储', 1061),
(357, '智能穿戴设备开发基础', '91', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '280', '文件存储', 1061),
(358, '智能穿戴设备开发基础', '91', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '294', '文件存储', 1061),
(359, '智能穿戴设备开发基础', '88', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '285', '文件存储', 1061),
(360, '智能穿戴设备开发基础', '80', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '348', '文件存储', 1061),
(361, '智能穿戴设备开发基础', '87', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '327', '文件存储', 1061),
(362, '智能穿戴设备开发基础', '81', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '291', '文件存储', 1061),
(363, '智能穿戴设备开发基础', '93', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '306', '文件存储', 1061),
(364, '智能穿戴设备开发基础', '80', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '307', '文件存储', 1061),
(365, '智能穿戴设备开发基础', '82', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '311', '文件存储', 1061),
(366, '智能穿戴设备开发基础', '87', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '320', '文件存储', 1061),
(367, '智能穿戴设备开发基础', '90', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '336', '文件存储', 1061),
(368, '智能穿戴设备开发基础', '82', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '343', '文件存储', 1061),
(369, '智能穿戴设备开发基础', '83', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '317', '文件存储', 1061),
(370, '智能穿戴设备开发基础', '93', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '322', '文件存储', 1061),
(371, '智能穿戴设备开发基础', '93', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '347', '文件存储', 1061),
(372, '智能穿戴设备开发基础', '80', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '314', '文件存储', 1061),
(373, '智能穿戴设备开发基础', '91', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '326', '文件存储', 1061),
(374, '智能穿戴设备开发基础', '88', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '285', '文件存储', 1061),
(375, '智能穿戴设备开发基础', '95', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '294', '文件存储', 1061),
(376, '智能穿戴设备开发基础', '84', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '344', '文件存储', 1061),
(377, '智能穿戴设备开发基础', '85', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '327', '文件存储', 1061),
(378, '智能穿戴设备开发基础', '94', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '322', '文件存储', 1061),
(379, '智能穿戴设备开发基础', '90', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '296', '文件存储', 1061),
(380, '智能穿戴设备开发基础', '95', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '314', '文件存储', 1061),
(624, '智能穿戴设备开发基础', '78', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '280', '网格布局', 1044),
(625, '智能穿戴设备开发基础', '85', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '350', '网格布局', 1044),
(626, '智能穿戴设备开发基础', '79', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '333', '网格布局', 1044),
(627, '智能穿戴设备开发基础', '85', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '285', '网格布局', 1044),
(628, '智能穿戴设备开发基础', '78', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '337', '网格布局', 1044),
(673, '智能穿戴设备开发基础', '61', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '308', '相对布局', 1041),
(621, '智能穿戴设备开发基础', '85', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '350', '网格布局', 1044),
(622, '智能穿戴设备开发基础', '87', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '303', '网格布局', 1044),
(391, '智能穿戴设备开发基础', '97', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '342', '绝对布局', 1046),
(392, '智能穿戴设备开发基础', '85', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '345', '绝对布局', 1046),
(393, '智能穿戴设备开发基础', '91', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '281', '绝对布局', 1046),
(394, '智能穿戴设备开发基础', '86', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '313', '绝对布局', 1046),
(395, '智能穿戴设备开发基础', '95', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '328', '绝对布局', 1046),
(396, '智能穿戴设备开发基础', '97', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '349', '绝对布局', 1046),
(397, '智能穿戴设备开发基础', '89', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '296', '绝对布局', 1046),
(398, '智能穿戴设备开发基础', '85', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '297', '绝对布局', 1046),
(399, '智能穿戴设备开发基础', '85', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '289', '绝对布局', 1046),
(400, '智能穿戴设备开发基础', '91', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '332', '绝对布局', 1046),
(401, '智能穿戴设备开发基础', '97', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '305', '表格布局', 1043),
(402, '智能穿戴设备开发基础', '85', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '342', '表格布局', 1043),
(403, '智能穿戴设备开发基础', '94', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '295', '表格布局', 1043),
(404, '智能穿戴设备开发基础', '87', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '338', '表格布局', 1043),
(405, '智能穿戴设备开发基础', '90', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '316', '表格布局', 1043),
(406, '智能穿戴设备开发基础', '94', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '285', '表格布局', 1043),
(407, '智能穿戴设备开发基础', '95', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '328', '表格布局', 1043),
(408, '智能穿戴设备开发基础', '85', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '308', '表格布局', 1043),
(409, '智能穿戴设备开发基础', '97', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '300', '表格布局', 1043),
(410, '智能穿戴设备开发基础', '87', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '306', '表格布局', 1043),
(411, '智能穿戴设备开发基础', '96', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '305', '表格布局', 1043),
(412, '智能穿戴设备开发基础', '95', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '322', '表格布局', 1043),
(413, '智能穿戴设备开发基础', '89', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '335', '表格布局', 1043),
(414, '智能穿戴设备开发基础', '96', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '292', '表格布局', 1043),
(415, '智能穿戴设备开发基础', '87', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '329', '表格布局', 1043),
(416, '智能穿戴设备开发基础', '92', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '289', '表格布局', 1043),
(417, '智能穿戴设备开发基础', '85', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '290', '表格布局', 1043),
(418, '智能穿戴设备开发基础', '91', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '284', '表格布局', 1043),
(419, '智能穿戴设备开发基础', '87', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '346', '表格布局', 1043),
(420, '智能穿戴设备开发基础', '94', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '296', '表格布局', 1043),
(421, '智能穿戴设备开发基础', '87', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '291', '线性布局', 1042),
(422, '智能穿戴设备开发基础', '86', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '290', '线性布局', 1042),
(423, '智能穿戴设备开发基础', '85', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '310', '线性布局', 1042),
(424, '智能穿戴设备开发基础', '94', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '334', '线性布局', 1042),
(425, '智能穿戴设备开发基础', '85', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '316', '线性布局', 1042),
(426, '智能穿戴设备开发基础', '92', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '340', '线性布局', 1042),
(427, '智能穿戴设备开发基础', '88', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '335', '线性布局', 1042),
(428, '智能穿戴设备开发基础', '88', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '338', '线性布局', 1042),
(429, '智能穿戴设备开发基础', '86', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '280', '线性布局', 1042),
(430, '智能穿戴设备开发基础', '97', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '289', '线性布局', 1042),
(431, '智能穿戴设备开发基础', '96', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '334', '线性布局', 1042),
(432, '智能穿戴设备开发基础', '97', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '288', '线性布局', 1042),
(433, '智能穿戴设备开发基础', '96', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '307', '线性布局', 1042),
(434, '智能穿戴设备开发基础', '93', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '346', '线性布局', 1042),
(435, '智能穿戴设备开发基础', '94', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '309', '线性布局', 1042),
(436, '智能穿戴设备开发基础', '97', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '348', '线性布局', 1042),
(437, '智能穿戴设备开发基础', '85', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '282', '线性布局', 1042),
(438, '智能穿戴设备开发基础', '85', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '286', '线性布局', 1042),
(688, '智能穿戴设备开发基础', '82', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '328', '相对布局', 1041),
(687, '智能穿戴设备开发基础', '82', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '325', '相对布局', 1041),
(686, '智能穿戴设备开发基础', '88', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '290', '相对布局', 1041),
(711, '智能穿戴设备开发基础', '91', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '295', '帧布局', 1045),
(623, '智能穿戴设备开发基础', '85', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '302', '网格布局', 1044),
(713, '智能穿戴设备开发基础', '85', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '336', '帧布局', 1045),
(637, '智能穿戴设备开发基础', '87', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '347', '网格布局', 1044),
(636, '智能穿戴设备开发基础', '87', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '285', '网格布局', 1044),
(635, '智能穿戴设备开发基础', '88', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '286', '网格布局', 1044),
(634, '智能穿戴设备开发基础', '88', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '348', '网格布局', 1044),
(633, '智能穿戴设备开发基础', '88', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '339', '网格布局', 1044),
(632, '智能穿戴设备开发基础', '86', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '297', '网格布局', 1044),
(631, '智能穿戴设备开发基础', '87', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '338', '网格布局', 1044),
(630, '智能穿戴设备开发基础', '88', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '313', '网格布局', 1044),
(629, '智能穿戴设备开发基础', '79', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '347', '网格布局', 1044),
(604, '智能穿戴设备开发基础', '83', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '347', '绝对布局', 1046),
(602, '智能穿戴设备开发基础', '85', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '313', '绝对布局', 1046),
(601, '智能穿戴设备开发基础', '76', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '282', '绝对布局', 1046),
(600, '智能穿戴设备开发基础', '83', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '311', '绝对布局', 1046),
(599, '智能穿戴设备开发基础', '81', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '335', '绝对布局', 1046),
(598, '智能穿戴设备开发基础', '79', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '308', '绝对布局', 1046),
(597, '智能穿戴设备开发基础', '89', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '331', '绝对布局', 1046),
(596, '智能穿戴设备开发基础', '78', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '322', '绝对布局', 1046),
(595, '智能穿戴设备开发基础', '90', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '304', '绝对布局', 1046),
(594, '智能穿戴设备开发基础', '88', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '333', '绝对布局', 1046),
(684, '智能穿戴设备开发基础', '72', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '338', '相对布局', 1041),
(683, '智能穿戴设备开发基础', '89', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '348', '相对布局', 1041),
(682, '智能穿戴设备开发基础', '88', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '306', '相对布局', 1041),
(681, '智能穿戴设备开发基础', '87', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '296', '相对布局', 1041),
(712, '智能穿戴设备开发基础', '90', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '285', '帧布局', 1045),
(593, '智能穿戴设备开发基础', '91', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1063),
(592, '智能穿戴设备开发基础', '86', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '292', 'SharedPreferences的使用', 1063),
(591, '智能穿戴设备开发基础', '81', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '349', 'SharedPreferences的使用', 1063),
(563, '智能穿戴设备开发基础', '89', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '343', 'SharedPreferences的使用', 1072),
(562, '智能穿戴设备开发基础', '85', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '341', 'ListView控件', 1072),
(553, '智能穿戴设备开发基础', '89', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '322', 'ListView控件', 1072),
(552, '智能穿戴设备开发基础', '94', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '317', 'ListView控件', 1072),
(551, '智能穿戴设备开发基础', '86', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '292', 'ListView控件', 1072),
(543, '智能穿戴设备开发基础', '99', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '344', 'ListView控件', 1072),
(550, '智能穿戴设备开发基础', '99', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '330', 'ListView控件', 1072),
(548, '智能穿戴设备开发基础', '99', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '328', 'ListView控件', 1072),
(571, '智能穿戴设备开发基础', '95', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1072),
(549, '智能穿戴设备开发基础', '99', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '300', 'ListView控件', 1072),
(547, '智能穿戴设备开发基础', '100', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '311', 'ListView控件', 1072),
(729, '智能穿戴设备开发基础', '100', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '348', 'XML序列化和解析', 1062),
(728, '智能穿戴设备开发基础', '100', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '322', 'XML序列化和解析', 1062),
(727, '智能穿戴设备开发基础', '96', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '341', 'XML序列化和解析', 1062),
(674, '智能穿戴设备开发基础', '75', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '336', '相对布局', 1041),
(672, '智能穿戴设备开发基础', '75', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '319', '相对布局', 1041),
(671, '智能穿戴设备开发基础', '60', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '341', '相对布局', 1041),
(670, '智能穿戴设备开发基础', '60', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '288', '相对布局', 1041),
(669, '智能穿戴设备开发基础', '64', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '311', '相对布局', 1041),
(668, '智能穿戴设备开发基础', '90', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '292', '相对布局', 1041),
(667, '智能穿戴设备开发基础', '83', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '325', '相对布局', 1041),
(666, '智能穿戴设备开发基础', '82', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '339', '相对布局', 1041),
(459, '智能穿戴设备开发基础', '87', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '315', '网格布局', 1044),
(460, '智能穿戴设备开发基础', '81', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '283', '网格布局', 1044),
(461, '智能穿戴设备开发基础', '95', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '292', '网格布局', 1044),
(462, '智能穿戴设备开发基础', '81', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '317', '网格布局', 1044),
(463, '智能穿戴设备开发基础', '90', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '326', '网格布局', 1044),
(464, '智能穿戴设备开发基础', '93', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '321', '网格布局', 1044),
(465, '智能穿戴设备开发基础', '89', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '334', '网格布局', 1044),
(466, '智能穿戴设备开发基础', '91', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '285', '网格布局', 1044),
(467, '智能穿戴设备开发基础', '86', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '345', '网格布局', 1044),
(468, '智能穿戴设备开发基础', '85', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '327', '网格布局', 1044),
(469, '智能穿戴设备开发基础', '85', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '285', '网格布局', 1044),
(470, '智能穿戴设备开发基础', '84', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '299', '网格布局', 1044),
(471, '智能穿戴设备开发基础', '96', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '321', '网格布局', 1044),
(472, '智能穿戴设备开发基础', '90', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '319', '网格布局', 1044),
(473, '智能穿戴设备开发基础', '91', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '333', '网格布局', 1044),
(474, '智能穿戴设备开发基础', '83', '13229857271', '2018-10-11 15:32:11', 'stu', 5, '283', '网格布局', 1044),
(475, '智能穿戴设备开发基础', '82', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '335', '网格布局', 1044),
(723, '智能穿戴设备开发基础', '69', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '299', '帧布局', 1045),
(722, '智能穿戴设备开发基础', '67', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '333', '帧布局', 1045),
(721, '智能穿戴设备开发基础', '83', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '312', '表格布局', 1043),
(720, '智能穿戴设备开发基础', '85', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '347', '表格布局', 1043),
(719, '智能穿戴设备开发基础', '83', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '310', '表格布局', 1043),
(718, '智能穿戴设备开发基础', '86', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '285', '表格布局', 1043),
(717, '智能穿戴设备开发基础', '83', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '315', '表格布局', 1043),
(716, '智能穿戴设备开发基础', '86', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '341', '表格布局', 1043),
(715, '智能穿戴设备开发基础', '52', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '335', '线性布局', 1042),
(714, '智能穿戴设备开发基础', '70', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '290', '线性布局', 1042),
(489, '智能穿戴设备开发基础', '97', '13672660891', '2018-10-11 15:32:11', 'stu', 5, '322', '帧布局', 1045),
(490, '智能穿戴设备开发基础', '90', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '348', '帧布局', 1045),
(491, '智能穿戴设备开发基础', '95', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '339', '帧布局', 1045),
(492, '智能穿戴设备开发基础', '96', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '335', '帧布局', 1045),
(493, '智能穿戴设备开发基础', '95', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '340', '帧布局', 1045),
(494, '智能穿戴设备开发基础', '95', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '306', '帧布局', 1045),
(495, '智能穿戴设备开发基础', '92', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '344', '帧布局', 1045),
(496, '智能穿戴设备开发基础', '94', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '342', '帧布局', 1045),
(497, '智能穿戴设备开发基础', '91', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '303', '帧布局', 1045),
(498, '智能穿戴设备开发基础', '91', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '296', '帧布局', 1045),
(499, '智能穿戴设备开发基础', '94', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '343', '帧布局', 1045),
(500, '智能穿戴设备开发基础', '96', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '310', '帧布局', 1045),
(501, '智能穿戴设备开发基础', '97', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '320', '帧布局', 1045),
(502, '智能穿戴设备开发基础', '98', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '288', '帧布局', 1045),
(503, '智能穿戴设备开发基础', '95', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '288', '帧布局', 1045),
(504, '智能穿戴设备开发基础', '94', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '320', '帧布局', 1045),
(505, '智能穿戴设备开发基础', '99', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '288', '绝对布局', 1046),
(506, '智能穿戴设备开发基础', '97', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '339', '绝对布局', 1046),
(507, '智能穿戴设备开发基础', '98', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '328', '绝对布局', 1046),
(508, '智能穿戴设备开发基础', '98', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '343', '绝对布局', 1046),
(509, '智能穿戴设备开发基础', '98', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '347', '绝对布局', 1046),
(510, '智能穿戴设备开发基础', '98', '15900146388', '2018-10-11 15:32:11', 'stu', 5, '314', '绝对布局', 1046),
(511, '智能穿戴设备开发基础', '98', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '309', 'XML序列化和解析', 1062),
(512, '智能穿戴设备开发基础', '97', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '298', 'XML序列化和解析', 1062),
(513, '智能穿戴设备开发基础', '99', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '341', 'XML序列化和解析', 1062),
(514, '智能穿戴设备开发基础', '99', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '330', 'XML序列化和解析', 1062),
(515, '智能穿戴设备开发基础', '97', '13229859287', '2018-10-11 15:32:11', 'stu', 5, '318', 'XML序列化和解析', 1062),
(516, '智能穿戴设备开发基础', '99', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '303', 'XML序列化和解析', 1062),
(517, '智能穿戴设备开发基础', '99', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '350', 'XML序列化和解析', 1062),
(518, '智能穿戴设备开发基础', '99', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '305', 'XML序列化和解析', 1062),
(519, '智能穿戴设备开发基础', '99', '13232363195', '2018-10-11 15:32:11', 'stu', 5, '283', 'XML序列化和解析', 1062),
(520, '智能穿戴设备开发基础', '97', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '281', 'XML序列化和解析', 1062),
(521, '智能穿戴设备开发基础', '98', '18102887565', '2018-10-11 15:32:11', 'stu', 5, '332', 'XML序列化和解析', 1062),
(522, '智能穿戴设备开发基础', '98', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '328', 'XML序列化和解析', 1062),
(523, '智能穿戴设备开发基础', '98', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '349', 'XML序列化和解析', 1062),
(524, '智能穿戴设备开发基础', '98', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '336', 'XML序列化和解析', 1062),
(586, '智能穿戴设备开发基础', '86', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '292', 'SharedPreferences的使用', 1063),
(585, '智能穿戴设备开发基础', '96', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '303', 'SharedPreferences的使用', 1063),
(527, '智能穿戴设备开发基础', '98', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '323', 'XML序列化和解析', 1062),
(528, '智能穿戴设备开发基础', '98', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '332', 'XML序列化和解析', 1062),
(529, '智能穿戴设备开发基础', '99', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '306', 'XML序列化和解析', 1062),
(584, '智能穿戴设备开发基础', '94', '13415357737', '2018-10-11 15:32:11', 'stu', 5, '295', 'SharedPreferences的使用', 1063),
(583, '智能穿戴设备开发基础', '98', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '347', 'SharedPreferences的使用', 1063),
(582, '智能穿戴设备开发基础', '78', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1063),
(581, '智能穿戴设备开发基础', '96', '13434511166', '2018-10-11 15:32:11', 'stu', 5, '303', 'SharedPreferences的使用', 1063),
(580, '智能穿戴设备开发基础', '94', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '321', 'SharedPreferences的使用', 1063),
(579, '智能穿戴设备开发基础', '98', '15077856695', '2018-10-11 15:32:11', 'stu', 5, '312', 'SharedPreferences的使用', 1063),
(578, '智能穿戴设备开发基础', '98', '13058352164', '2018-10-11 15:32:11', 'stu', 5, '301', 'SharedPreferences的使用', 1063),
(577, '智能穿戴设备开发基础', '97', '17827930844', '2018-10-11 15:32:11', 'stu', 5, '329', 'SharedPreferences的使用', 1063),
(576, '智能穿戴设备开发基础', '99', '13202408649', '2018-10-11 15:32:11', 'stu', 5, '280', 'SharedPreferences的使用', 1063),
(575, '智能穿戴设备开发基础', '98', '13229851887', '2018-10-11 15:32:11', 'stu', 5, '304', 'SharedPreferences的使用', 1063);

-- --------------------------------------------------------

--
-- 表的结构 `api_section_item`
--

CREATE TABLE IF NOT EXISTS `api_section_item` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `belong_course` int(10) NOT NULL DEFAULT '0',
  `section_title` varchar(20) NOT NULL,
  `section_sequence` int(3) NOT NULL,
  `learning` int(10) NOT NULL DEFAULT '0',
  `count` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=135 ;

--
-- 转存表中的数据 `api_section_item`
--

INSERT INTO `api_section_item` (`id`, `belong_course`, `section_title`, `section_sequence`, `learning`, `count`) VALUES
(97, 1, '', 15, 0, 0),
(96, 1, '', 14, 0, 0),
(95, 1, '', 13, 0, 0),
(94, 1, '', 12, 0, 0),
(93, 1, '', 11, 0, 0),
(92, 1, '', 10, 0, 0),
(91, 1, '', 9, 0, 0),
(90, 1, '', 8, 0, 0),
(89, 1, '', 7, 0, 0),
(88, 1, '', 6, 0, 0),
(87, 1, '', 5, 0, 0),
(86, 1, '', 4, 0, 0),
(85, 1, '测试章节', 3, 0, 1),
(83, 1, 'Java的前世今生', 1, 0, 1),
(84, 1, 'Java之父', 2, 0, 2),
(102, 1, '', 20, 0, 0),
(101, 1, '', 19, 0, 0),
(100, 1, '', 18, 0, 0),
(99, 1, '', 17, 0, 0),
(98, 1, '', 16, 0, 0),
(103, 5, 'Android基础入门', 1, 0, 3),
(104, 5, 'Android UI开发', 2, 0, 6),
(105, 5, 'Activity ', 3, 0, 2),
(106, 5, '数据存储', 4, 0, 3),
(107, 5, 'SQLite数据库', 5, 0, 3),
(108, 5, '内容提供者', 6, 0, 2),
(109, 5, '服务', 7, 0, 3),
(111, 2, '', 1, 0, 2),
(112, 2, '', 2, 0, 0),
(113, 2, '', 3, 0, 0),
(114, 2, '', 4, 0, 0),
(115, 2, '', 5, 0, 0),
(116, 2, '', 6, 0, 0),
(117, 2, '', 7, 0, 0),
(118, 2, '', 8, 0, 0),
(119, 2, '', 9, 0, 0),
(120, 2, '', 10, 0, 0),
(121, 2, '', 11, 0, 0),
(122, 2, '', 12, 0, 0),
(123, 2, '', 13, 0, 0),
(124, 2, '', 14, 0, 0),
(125, 2, '', 15, 0, 0),
(126, 2, '', 16, 0, 0),
(127, 2, '', 17, 0, 0),
(128, 2, '', 18, 0, 0),
(129, 2, '', 19, 0, 0),
(130, 2, '', 20, 0, 0),
(131, 6, '第1章 Python入门导学', 1, 0, 2),
(132, 6, '第2章 Python环境安装', 2, 0, 3),
(133, 6, '第3章 理解什么是写代码与Python的', 3, 0, 5),
(134, 6, '第4章 Python中表示“组”的概念与', 4, 0, 5);

-- --------------------------------------------------------

--
-- 表的结构 `api_section_manage`
--

CREATE TABLE IF NOT EXISTS `api_section_manage` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `cid` int(10) NOT NULL,
  `title` varchar(55) NOT NULL,
  `count` int(5) NOT NULL,
  `squence` int(5) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=60 ;

--
-- 转存表中的数据 `api_section_manage`
--

INSERT INTO `api_section_manage` (`id`, `cid`, `title`, `count`, `squence`) VALUES
(38, 1, '', 0, 19),
(37, 1, '', 0, 18),
(36, 1, '', 0, 17),
(35, 1, '', 0, 16),
(34, 1, '', 0, 15),
(33, 1, '', 0, 14),
(32, 1, '', 0, 13),
(31, 1, '', 0, 12),
(30, 1, '', 0, 11),
(29, 1, '', 0, 10),
(28, 1, '', 0, 9),
(27, 1, '', 0, 8),
(26, 1, '', 0, 7),
(25, 1, '', 0, 6),
(24, 1, '', 0, 5),
(23, 1, '', 0, 4),
(22, 1, '', 0, 3),
(21, 1, 'Java之父', 1, 2),
(20, 1, 'Java的前世今生', 2, 1),
(39, 1, '', 0, 20),
(40, 2, '', 0, 1),
(41, 2, '', 0, 2),
(42, 2, '', 0, 3),
(43, 2, '', 0, 4),
(44, 2, '', 0, 5),
(45, 2, '', 0, 6),
(46, 2, '', 0, 7),
(47, 2, '', 0, 8),
(48, 2, '', 0, 9),
(49, 2, '', 0, 10),
(50, 2, '', 0, 11),
(51, 2, '', 0, 12),
(52, 2, '', 0, 13),
(53, 2, '', 0, 14),
(54, 2, '', 0, 15),
(55, 2, '', 0, 16),
(56, 2, '', 0, 17),
(57, 2, '', 0, 18),
(58, 2, '', 0, 19),
(59, 2, '', 0, 20);

-- --------------------------------------------------------

--
-- 表的结构 `api_small_sction_item`
--

CREATE TABLE IF NOT EXISTS `api_small_sction_item` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `sid` int(10) NOT NULL,
  `videopath` varchar(55) NOT NULL,
  `title` varchar(30) NOT NULL,
  `testid` int(10) NOT NULL,
  `viedo_length` varchar(20) NOT NULL,
  `user` varchar(55) NOT NULL,
  `status` int(2) NOT NULL DEFAULT '0',
  `txtsource` varchar(55) NOT NULL DEFAULT 'null',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=49 ;

--
-- 转存表中的数据 `api_small_sction_item`
--

INSERT INTO `api_small_sction_item` (`id`, `sid`, `videopath`, `title`, `testid`, `viedo_length`, `user`, `status`, `txtsource`) VALUES
(1, 1, '/videopath/xxxxx.mp4', '1.Java之父---xxxx', 1, '132', '常亚萍', 1, 'null'),
(2, 1, 'videopath/xxxx.mp4', '2.Java和其他语言相比', 1, '225', '常亚萍', 1, 'null'),
(3, 2, '/videopath/xxxxx.mp4', '1.Java 虚拟机介绍', 2, '388', '常亚萍', 1, 'null'),
(5, 84, '/viedeo/15416484152874816.mp4', 'java从入门到精通[2013版-美著]', 2, '1234', '常亚萍', 1, 'null'),
(6, 84, '/viedeo/15704303482958037.mp4', 'java简介', 3, '545', '常亚萍', 1, 'null'),
(7, 103, '/viedeo/15708000832126372.mp4', 'Android简介', 2, '325', '常亚萍', 1, '15708000831587218.rar'),
(8, 103, '/viedeo/15707094885829589.mp4', 'Android开发环境搭建', 2, '381', '常亚萍', 1, 'null'),
(9, 103, '/viedeo/15707095063296691.mp4', '开发第一个Android程序', 2, '389', '常亚萍', 1, 'null'),
(13, 105, '/viedeo/15707096594337371.mp4', 'Activity的创建', 3, '415', '常亚萍', 1, 'null'),
(11, 83, '/viedeo/15500295122977263.mp4', '1.Java的学习建议', 3, '512', '常亚萍', 1, 'null'),
(12, 85, '/viedeo/15500417024527984.mp4', '1.仅做测试使用', 2, '300', '常亚萍', 1, 'null'),
(14, 105, '/viedeo/15707096793804808.mp4', 'Activity中的数据传递', 2, '501', '常亚萍', 1, 'null'),
(15, 104, '/viedeo/15707095398073821.mp4', '相对布局', 9, '421', '常亚萍', 1, 'null'),
(16, 104, '/viedeo/15707095695515380.mp4', '线性布局', 10, '321', '常亚萍', 1, 'null'),
(17, 104, '/viedeo/15707095853438414.mp4', '表格布局', 10, '355', '常亚萍', 1, 'null'),
(18, 104, '/viedeo/15707095982692168.mp4', '网格布局', 14, '421', '常亚萍', 1, 'null'),
(19, 104, '/viedeo/15707096129459197.mp4', '帧布局', 0, '451', '常亚萍', 1, 'null'),
(20, 104, '/viedeo/15707096253071471.mp4', '绝对布局', 0, '411', '常亚萍', 1, 'null'),
(21, 131, '/viedeo/15508824552827574.mp4', '1-1课程导学', 0, '325', '常亚萍', 1, 'null'),
(22, 131, '/viedeo/15508824823627654.mp4', '1-2Python的特点', 0, '221', '常亚萍', 1, 'null'),
(23, 132, '/viedeo/15508825221820677.mp4', ' 2-1 下载Python安装包', 0, '215', '常亚萍', 1, 'null'),
(24, 132, '/viedeo/15508825342157134.mp4', ' 2-2 安装Python', 0, '154', '常亚萍', 1, 'null'),
(25, 132, '/viedeo/15508825517190246.mp4', '2-3 IDLE与第一段Python代码', 0, '112', '常亚萍', 1, 'null'),
(26, 133, '/viedeo/15508825894971282.mp4', '3-1 什么是代码，什么是写代码', 0, '1213', '常亚萍', 1, 'null'),
(27, 133, '/viedeo/15508826024838622.mp4', ' 3-2 数字：整形与浮点型', 0, '1147', '常亚萍', 1, 'null'),
(28, 133, '/viedeo/15508826135425567.mp4', ' 3-3 10、2、8、16进制', 0, '124', '常亚萍', 1, 'null'),
(29, 133, '/viedeo/15508826278511901.mp4', ' 3-4 各进制的表示与转换', 0, '1242', '常亚萍', 1, 'null'),
(30, 133, '/viedeo/15508826377844207.mp4', ' 3-5 数字：布尔类型与复数', 0, '1142', '常亚萍', 1, 'null'),
(31, 134, '/viedeo/15508826643549926.mp4', ' 4-1 列表的定义', 0, '1235', '常亚萍', 1, 'null'),
(32, 134, '/viedeo/15508826767270171.mp4', ' 4-2 列表的基本操作', 0, '1234', '常亚萍', 1, 'null'),
(33, 134, '/viedeo/15508826897636291.mp4', ' 4-3 元组', 0, '1234', '常亚萍', 1, 'null'),
(34, 134, '/viedeo/15508826995215178.mp4', ' 4-4 序列总结', 0, '1246', '常亚萍', 1, 'null'),
(35, 134, '/viedeo/15508827085548339.mp4', ' 4-5 set 集合', 0, '1234', '常亚萍', 1, 'null'),
(36, 106, '/viedeo/15707097109708862.mp4', '文件存储', 0, '381', '常亚萍', 1, 'null'),
(37, 106, '/viedeo/15707097253552397.mp4', 'XML序列化和解析', 0, '391', '常亚萍', 1, 'null'),
(38, 106, '/viedeo/15707097409219146.mp4', 'SharedPreferences的使用', 0, '421', '常亚萍', 1, 'null'),
(39, 107, '/viedeo/15707097785199523.mp4', '数据库的常用操作', 0, '355', '常亚萍', 1, 'null'),
(40, 107, '/viedeo/15707097952898986.mp4', 'ListView控件', 0, '423', '常亚萍', 1, 'null'),
(41, 107, '/viedeo/15707098096232513.mp4', '读取数据库中的内容显示到ListView中', 0, '388', '常亚萍', 1, 'null'),
(42, 108, '/viedeo/15707098686348968.mp4', '读取联系人信息', 0, '399', '常亚萍', 1, 'null'),
(43, 108, '/viedeo/15707098799562744.mp4', '读取短信信息', 0, '441', '常亚萍', 1, 'null'),
(44, 109, '/viedeo/15707099029604766.mp4', '服务的创建', 0, '411', '常亚萍', 1, 'null'),
(45, 109, '/viedeo/15707099167294616.mp4', 'start方式启动服务', 0, '381', '常亚萍', 1, 'null'),
(46, 109, '/viedeo/15707099327631347.mp4', 'bind方式启动服务', 0, '422', '常亚萍', 1, 'null'),
(47, 111, '/viedeo/15705226123254393.mp4', '1.1 php简介', 0, '233', '常亚萍', 0, 'null'),
(48, 111, '/viedeo/15705227623112395.mp4', '1.2 php基本变量', 0, '458', '常亚萍', 0, 'null');

-- --------------------------------------------------------

--
-- 表的结构 `api_small_test`
--

CREATE TABLE IF NOT EXISTS `api_small_test` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `sid` int(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `during` varchar(30) NOT NULL,
  `user` varchar(11) NOT NULL,
  `score` varchar(3) NOT NULL,
  `time` varchar(55) NOT NULL,
  `classname` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `api_small_test`
--

INSERT INTO `api_small_test` (`id`, `sid`, `name`, `during`, `user`, `score`, `time`, `classname`) VALUES
(2, 7, '周庚明', '300', '13672660891', '90', '2018-10-14 10:48:47', '17移动应用开发1班'),
(5, 7, '周小明', '9', '13058352164', '25', '2018-10-15 11:35:55', '17移动应用开发1班');

-- --------------------------------------------------------

--
-- 表的结构 `api_stucou`
--

CREATE TABLE IF NOT EXISTS `api_stucou` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `user` varchar(11) NOT NULL,
  `courseid` int(10) NOT NULL,
  `pro` int(5) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=41 ;

--
-- 转存表中的数据 `api_stucou`
--

INSERT INTO `api_stucou` (`id`, `user`, `courseid`, `pro`) VALUES
(36, '13672660891', 3, 2),
(37, '13672660891', 1, 2),
(40, '18928070670', 1, 4),
(39, '18928070670', 3, 1),
(38, '13672660891', 4, 1),
(35, '13672660891', 5, 4);

-- --------------------------------------------------------

--
-- 表的结构 `api_student`
--

CREATE TABLE IF NOT EXISTS `api_student` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `no` varchar(15) NOT NULL,
  `binduser` varchar(11) NOT NULL DEFAULT '',
  `isbind` int(2) NOT NULL DEFAULT '0',
  `name` varchar(10) NOT NULL,
  `classname` varchar(20) NOT NULL,
  `academic` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `api_student`
--

INSERT INTO `api_student` (`id`, `no`, `binduser`, `isbind`, `name`, `classname`, `academic`) VALUES
(1, '0114170103', '13672660891', 1, '周庚明', '17移动应用开发1', '计算机工程学院');

-- --------------------------------------------------------

--
-- 表的结构 `api_subject`
--

CREATE TABLE IF NOT EXISTS `api_subject` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `pid` int(10) NOT NULL,
  `a` varchar(55) NOT NULL DEFAULT '',
  `b` varchar(55) NOT NULL DEFAULT '',
  `c` varchar(55) NOT NULL DEFAULT '',
  `d` varchar(55) NOT NULL DEFAULT '',
  `trueoption` varchar(2) NOT NULL DEFAULT '',
  `title` varchar(55) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=65 ;

--
-- 转存表中的数据 `api_subject`
--

INSERT INTO `api_subject` (`id`, `pid`, `a`, `b`, `c`, `d`, `trueoption`, `title`) VALUES
(1, 2, '冷饮', '功能维生素饮料', '可乐', '白开水', 'A', '请问在剧烈运动中，适合喝些什么？'),
(2, 2, '阿瑟东阿瑟东', '我测试的', '嗯嗯', '好的', 'B', '啊实打实打算大苏打'),
(3, 2, '哦哦哦没问题', '好的', '嗯嗯嗯', '啦啦啦啦', 'C', '阿瑟东阿瑟东'),
(4, 2, '呵呵呵', '啊圣诞快乐', '俺的看来', '你卡上的', 'D', '为非法手段'),
(5, 2, '撒旦能尽快 ', '你卡上', '尼撒看见', '三年时间看', 'A', '啊哈哈哈'),
(6, 3, '', '', '', '', '', ''),
(7, 3, '', '', '', '', '', ''),
(8, 3, '', '', '', '', '', ''),
(9, 3, '', '', '', '', '', ''),
(10, 3, '', '', '', '', '', ''),
(11, 7, '', '', '', '', '', ''),
(12, 8, '', '', '', '', '', ''),
(13, 9, '', '', '', '', '', ''),
(14, 9, '', '', '', '', '', ''),
(15, 9, '', '', '', '', '', ''),
(16, 10, 'android:layout_alignLeft', 'android:layout_alignParentLeft', 'android:layout_left', 'android:orientation', 'D', '1.以下属性中，( )属性可以设置线性布局的方向？'),
(17, 10, '线性布局', '相对布局', '表格布局', '网格布局', 'B', '2.创建Android程序时，默认使用的布局是？'),
(18, 10, '垂直', '水平', '居中', '居左', 'B', '3.线性布局默认方向是？'),
(19, 11, '', '', '', '', '', ''),
(20, 11, '', '', '', '', '', ''),
(21, 12, '', '', '', '', '', ''),
(22, 12, '', '', '', '', '', ''),
(23, 12, '', '', '', '', '', ''),
(24, 12, '', '', '', '', '', ''),
(25, 13, '', '', '', '', '', ''),
(26, 13, '', '', '', '', '', ''),
(27, 13, '', '', '', '', '', ''),
(28, 13, '', '', '', '', '', ''),
(29, 13, '', '', '', '', '', ''),
(30, 14, '', '', '', '', '', ''),
(31, 14, '', '', '', '', '', ''),
(32, 14, '', '', '', '', '', ''),
(33, 14, '', '', '', '', '', ''),
(34, 14, '', '', '', '', '', ''),
(35, 15, '', '', '', '', '', ''),
(36, 15, '', '', '', '', '', ''),
(37, 15, '', '', '', '', '', ''),
(38, 15, '', '', '', '', '', ''),
(39, 15, '', '', '', '', '', ''),
(40, 16, '', '', '', '', '', ''),
(41, 16, '', '', '', '', '', ''),
(42, 16, '', '', '', '', '', ''),
(43, 16, '', '', '', '', '', ''),
(44, 16, '', '', '', '', '', ''),
(45, 17, '', '', '', '', '', ''),
(46, 17, '', '', '', '', '', ''),
(47, 17, '', '', '', '', '', ''),
(48, 17, '', '', '', '', '', ''),
(49, 17, '', '', '', '', '', ''),
(50, 18, '', '', '', '', '', ''),
(51, 18, '', '', '', '', '', ''),
(52, 18, '', '', '', '', '', ''),
(53, 18, '', '', '', '', '', ''),
(54, 18, '', '', '', '', '', ''),
(55, 19, '', '', '', '', '', ''),
(56, 19, '', '', '', '', '', ''),
(57, 19, '', '', '', '', '', ''),
(58, 19, '', '', '', '', '', ''),
(59, 19, '', '', '', '', '', ''),
(60, 20, '', '', '', '', '', ''),
(61, 20, '', '', '', '', '', ''),
(62, 20, '', '', '', '', '', ''),
(63, 20, '', '', '', '', '', ''),
(64, 20, '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `api_sutdentinfo`
--

CREATE TABLE IF NOT EXISTS `api_sutdentinfo` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `no` varchar(15) NOT NULL,
  `classname` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `api_sutdentinfo`
--

INSERT INTO `api_sutdentinfo` (`id`, `name`, `no`, `classname`) VALUES
(4, '周小明', '0114170104', '17移动应用开发1班'),
(3, '周庚明', '0114170103', '17移动应用开发1班');

-- --------------------------------------------------------

--
-- 表的结构 `api_teacher`
--

CREATE TABLE IF NOT EXISTS `api_teacher` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `department` varchar(30) NOT NULL,
  `class` varchar(30) NOT NULL,
  `password` varchar(18) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- 转存表中的数据 `api_teacher`
--

INSERT INTO `api_teacher` (`id`, `name`, `department`, `class`, `password`) VALUES
(1, '常亚萍', '大数据学院', '17移动互联2班', '123'),
(2, 'admin', '*', '*', '123');

-- --------------------------------------------------------

--
-- 表的结构 `api_text`
--

CREATE TABLE IF NOT EXISTS `api_text` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `pid` int(10) NOT NULL,
  `path` varchar(55) NOT NULL,
  `title` varchar(55) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `api_text`
--

INSERT INTO `api_text` (`id`, `pid`, `path`, `title`) VALUES
(1, 4, 'amzmo.doc', '学习资料');

-- --------------------------------------------------------

--
-- 表的结构 `api_user`
--

CREATE TABLE IF NOT EXISTS `api_user` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `username` varchar(11) NOT NULL,
  `pwd` varchar(32) NOT NULL,
  `type` varchar(30) NOT NULL,
  `addtime` varchar(20) NOT NULL,
  `isbind` int(2) NOT NULL DEFAULT '0',
  `no` varchar(20) NOT NULL,
  `class` varchar(20) NOT NULL,
  `departement` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=20 ;

--
-- 转存表中的数据 `api_user`
--

INSERT INTO `api_user` (`id`, `username`, `pwd`, `type`, `addtime`, `isbind`, `no`, `class`, `departement`) VALUES
(1, '13058352164', '123', 'stu', '2018-09-11 09:21:37', 1, '0112170123', '17移动互联2班', '大数据学院'),
(2, '13202408649', '123', 'stu', '2018-09-11 17:17:18', 1, '0112170122', '17移动互联2班', '大数据学院'),
(3, '13672660891', '123', 'stu', '2018-09-10 13:16:16', 0, '0112170120', '17移动互联2班', '大数据学院'),
(4, '13434511166', '123', 'stu', '2018-09-10 05:16:12', 0, '0112170119', '17移动互联2班', '大数据学院'),
(5, '15900146388', '123', 'stu', '2018-09-12 06:17:14', 0, '0112170118', '17移动互联2班', '大数据学院'),
(6, '13232363195', '123', 'stu', '2018-09-12 08:18:12', 0, '0112170117', '17移动互联2班', '大数据学院'),
(13, '17827930844', '123', 'stu', '2018-09-12 13:21:56', 0, '0112170116', '17移动互联2班', '大数据学院'),
(14, '13229857271', '123', 'stu', '2018-09-12 14:21:37', 0, '0112170113', '17移动互联2班', '大数据学院'),
(15, '15077856695', '123', 'stu', '2018-09-12 10:21:10', 0, '0112170112', '17移动互联2班', '大数据学院'),
(16, '18102887565', '123', 'stu', '2018-09-13 13:26:11', 0, '0112170105', '17移动互联2班', '大数据学院'),
(17, '13229851887', '123', 'stu', '2018-09-13 15:27:37', 0, '0112170103', '17移动互联2班', '大数据学院'),
(18, '13229859287', '123', 'stu', '2018-09-14 17:26:37', 0, '0112170102', '17移动互联2班', '大数据学院'),
(19, '13415357737', '123', 'stu', '2018-09-14 18:26:39', 0, '0112170101', '17移动互联2班', '大数据学院');

-- --------------------------------------------------------

--
-- 表的结构 `api_usertype`
--

CREATE TABLE IF NOT EXISTS `api_usertype` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(22) NOT NULL,
  `time` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=8 ;

--
-- 转存表中的数据 `api_usertype`
--

INSERT INTO `api_usertype` (`id`, `name`, `time`) VALUES
(1, '学生用户', '2018-07-22  08:51:12'),
(2, '教师用户', '2018-07-22 09:13:18');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
